goog.provide('dm.conf.SP');
	dm.conf.SP = {
    "b1": {
        "id": "b1",
        "func": {
            "a1": "1",
            "a17": "0.2"
        },
        "def": "0",
        "add": "1",
        "name": "力量",
        "desc": "每点增加1基础攻击力,0.2%双倍伤害暴击几率"
    },
    "b2": {
        "id": "b2",
        "func": {
            "a3": "1",
            "a18": "0.2"
        },
        "def": "0",
        "add": "1",
        "name": "灵巧",
        "desc": "每点增加1防御力,0.2%闪避攻击几率"
    },
    "b3": {
        "id": "b3",
        "func": {
            "a6": "5",
            "a5": "1"
        },
        "def": "0",
        "add": "1",
        "name": "耐力",
        "desc": "每点增加5HP,1MP"
    },
    "b4": {
        "id": "b4",
        "func": {
            "a26": "1",
            "a28": "5",
            "a31": "1",
            "a33": "5",
            "a36": "1",
            "a38": "5",
            "a41": "1",
            "a43": "5"
        },
        "def": "0",
        "add": "1",
        "name": "幸运",
        "desc": "血魔钱经验:增加1%暴击几率,5%增加比例"
    }
}