goog.provide('dm.conf.SP');
	dm.conf.SP = {
    "a1": {
        "id": "a1",
        "def": "1",
        "name": "基础攻击力",
        "desc": "连骷髅图标时的初始攻击力"
    },
    "a2": {
        "id": "a2",
        "def": "1",
        "name": "武器攻击力",
        "desc": "每连1个武器图标的攻击力"
    },
    "a3": {
        "id": "a3",
        "def": "100",
        "name": "防御值上限"
    },
    "a4": {
        "id": "a4",
        "def": "100",
        "name": "生命值上限",
        "desc": "增加的上限值"
    },
    "a5": {
        "id": "a5",
        "def": "100",
        "name": "强化升级上限",
        "desc": "当前值大于等于上限时,可以进行1次强化"
    },
    "a6": {
        "id": "a6",
        "def": "100",
        "name": "金钱升级上限",
        "desc": "当前值大于等于上限时,可以购买1次新装备(旧装备提升属性)"
    },
    "a7": {
        "id": "a7",
        "def": "1",
        "name": "防御减少伤害百分比",
        "desc": "防御值可以抵挡伤害值的百分比"
    },
    "a8": {
        "id": "a8",
        "def": "1",
        "name": "无视对方防御百分比",
        "desc": "攻击时无视对方20%的防御值"
    },
    "a9": {
        "id": "a9",
        "def": "1",
        "name": "攻击时是否释放毒药buff",
        "desc": "攻击时会使目标中毒"
    },
    "a10": {
        "id": "a10",
        "def": "1",
        "name": "毒药buff伤害",
        "desc": "中毒的骷髅每回合受到多少毒药伤害"
    },
    "a11": {
        "id": "a11",
        "def": "1",
        "name": "反弹伤害值",
        "desc": "每回合每个骷髅发生过攻击的骷髅必然损失的HP值"
    },
    "a12": {
        "id": "a12",
        "def": "1",
        "name": "每连1个防御图标获得当前防御值",
        "desc": "消除1个防御图标后获得的当前防御值"
    },
    "a13": {
        "id": "a13",
        "def": "1",
        "name": "每连1个血瓶图标获得当前生命值",
        "desc": "消除1个血瓶图标后获得的当前生命值"
    },
    "a14": {
        "id": "a14",
        "def": "1",
        "name": "blood暴击基础值",
        "desc": "暴击后额外增加的经验值百分比"
    },
    "a15": {
        "id": "a15",
        "def": "1",
        "name": "blood暴击几率",
        "desc": "暴击率百分比"
    },
    "a16": {
        "id": "a16",
        "def": "1",
        "name": "blood暴击加成值",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a17": {
        "id": "a17",
        "def": "1",
        "name": "blood暴击值增加比例",
        "desc": "提升暴击增加值比例"
    },
    "a18": {
        "id": "a18",
        "def": "1",
        "name": "每连1个金钱图标获得金钱值",
        "desc": "消除1个金钱图标后获得的当前金钱值"
    },
    "a19": {
        "id": "a19",
        "def": "1",
        "name": "金钱暴击基础值",
        "desc": "暴击后额外增加的经验值百分比"
    },
    "a20": {
        "id": "a20",
        "def": "1",
        "name": "金钱暴击几率",
        "desc": "暴击率百分比"
    },
    "a21": {
        "id": "a21",
        "def": "1",
        "name": "金钱暴击加成值",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a22": {
        "id": "a22",
        "def": "1",
        "name": "金钱暴击值增加比例",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a23": {
        "id": "a23",
        "def": "1",
        "name": "每连1个经验图标获得经验值",
        "desc": "消除1个骷髅图标后获得的当前经验值"
    },
    "a24": {
        "id": "a24",
        "def": "1",
        "name": "经验暴击基础值",
        "desc": "暴击后额外增加的经验值百分比"
    },
    "a25": {
        "id": "a25",
        "def": "1",
        "name": "经验暴击几率",
        "desc": "暴击率百分比"
    },
    "a26": {
        "id": "a26",
        "def": "1",
        "name": "经验暴击加成值",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a27": {
        "id": "a27",
        "def": "1",
        "name": "经验暴击值增加比例",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a28": {
        "id": "a28",
        "def": "1",
        "name": "每连1个防御图标获得强化值",
        "desc": "消除1个防御图标后获得的当前强化值"
    },
    "a29": {
        "id": "a29",
        "def": "1",
        "name": "防御暴击基础值",
        "desc": "暴击后额外增加的经验值百分比"
    },
    "a30": {
        "id": "a30",
        "def": "1",
        "name": "防御暴击几率",
        "desc": "暴击率百分比"
    },
    "a31": {
        "id": "a31",
        "def": "1",
        "name": "防御暴击加成值",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "a32": {
        "id": "a32",
        "def": "1",
        "name": "防御暴击值增加比例",
        "desc": "暴击后提升暴击基础值的百分比"
    },
    "b1": {
        "id": "b1",
        "func": {
            "a1": "1",
            "a19": "5"
        },
        "name": "力量",
        "desc": "每点增加1基础攻击力,5%经验暴击几率"
    },
    "b2": {
        "id": "b2",
        "func": {
            "a21": "1",
            "a24": "5"
        },
        "name": "灵巧",
        "desc": "每点增加1防御力,5%防御暴击几率"
    },
    "b3": {
        "id": "b3",
        "func": {
            "a3": "5",
            "a15": "5"
        },
        "name": "耐力",
        "desc": "每点增加5HP,5%血瓶暴击几率"
    },
    "b4": {
        "id": "b4",
        "func": {
            "a3": "5",
            "a16": "5"
        },
        "name": "幸运",
        "desc": "每点增加5HP,5%金钱暴击几率"
    }
}