goog.provide('dm.conf.SP');
	dm.conf.SP = {
    "b1": {
        "id": "b1",
        "func": {
            "a1": "1",
            "a37": "0.2"
        },
        "def": "0",
        "inc": "1",
        "name": "力量",
        "desc": "每点增加1基础攻击力,0.2%双倍伤害暴击几率"
    },
    "b2": {
        "id": "b2",
        "func": {
            "a3": "1",
            "a38": "0.2"
        },
        "def": "0",
        "inc": "1",
        "name": "灵巧",
        "desc": "每点增加1防御力,0.2%闪避攻击几率"
    },
    "b3": {
        "id": "b3",
        "func": {
            "a6": "5",
            "a5": "1"
        },
        "def": "0",
        "inc": "1",
        "name": "耐力",
        "desc": "每点增加5HP,1MP"
    },
    "b4": {
        "id": "b4",
        "func": {
            "a10": "1",
            "a12": "5",
            "a14": "1",
            "a16": "5",
            "a18": "1",
            "a20": "5",
            "a22": "1",
            "a24": "5"
        },
        "def": "0",
        "inc": "1",
        "name": "幸运",
        "desc": "血魔钱经验:增加1%暴击几率,5%增加比例"
    }
}